<a href="https://colab.research.google.com/github/kamonsiri080/DW/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Pandas

data management tool

In [0]:
import pandas as pd

In [12]:
df = pd.read_csv('https://raw.githubusercontent.com/kamonsiri080/DW/master/titanic.csv',delimiter=",",header = None)
df

         0                                                1   ...   10   11
0     First                    Allen, Miss. Elisabeth Walton  ...    2  Yes
1     First                   Allison, Master. Hudson Trevor  ...   11  Yes
2     First                     Allison, Miss. Helen Loraine  ...  NaN   No
3     First             Allison, Mr. Hudson Joshua Creighton  ...  NaN   No
4     First  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...  NaN   No
...     ...                                              ...  ...  ...  ...
1304  Third                             Zabour, Miss. Hileni  ...  NaN   No
1305  Third                            Zabour, Miss. Thamine  ...  NaN   No
1306  Third                        Zakarian, Mr. Mapriededer  ...  NaN   No
1307  Third                              Zakarian, Mr. Ortin  ...  NaN   No
1308  Third                               Zimmerman, Mr. Leo  ...  NaN   No

[1309 rows x 12 columns]

#Pandas Data Access

Access header of column

In [14]:
df.columns

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], dtype='int64')

Access data of each column

In [16]:
df[0]

0       First
1       First
2       First
3       First
4       First
        ...
1304    Third
1305    Third
1306    Third
1307    Third
1308    Third
Name: 0, Length: 1309, dtype: object

Access each elements of data same as numpy

In [17]:
df.iloc[2,0:5]

0                           First
1    Allison, Miss. Helen Loraine
2                          Female
3                               2
4                               1
Name: 2, dtype: object

#Pandas Mix Type Dataset
dataset can be mix type

In [18]:
df.dtypes

0      object
1      object
2      object
3     float64
4       int64
5       int64
6      object
7     float64
8      object
9      object
10     object
11     object
dtype: object

#Fine Min & Max

In [21]:
df[3].max()

80.0

In [23]:
df[3].min()

0.1667

Use dataframe to find a specific row or element

In [27]:
df[1][df[3]==df[3].max()]

14    Barkworth, Mr. Algernon Henry Wilson
Name: 1, dtype: object

#Missing Values

Find Missing Values

In [30]:
df.shape

(1309, 12)

In [31]:
df.isnull().sum(axis=0)

0        0
1        0
2        0
3      263
4        0
5        0
6        0
7        1
8     1014
9        2
10     823
11       0
dtype: int64

In [47]:
df_clean_column = df.drop([1,3,6,8,9,10],axis=1)
df_clean_column.isnull().sum(axis=0)

0     0
2     0
4     0
5     0
7     1
11    0
dtype: int64

In [48]:
df_clean_row = df_clean_column.dropna(axis = 0)
df_clean_row.isnull().sum(axis=0)

0     0
2     0
4     0
5     0
7     0
11    0
dtype: int64

In [49]:
df_clean_row

         0       2   4   5         7    11
0     First  Female   0   0  211.3375  Yes
1     First    Male   1   2  151.5500  Yes
2     First  Female   1   2  151.5500   No
3     First    Male   1   2  151.5500   No
4     First  Female   1   2  151.5500   No
...     ...     ...  ..  ..       ...  ...
1304  Third  Female   1   0   14.4542   No
1305  Third  Female   1   0   14.4542   No
1306  Third    Male   0   0    7.2250   No
1307  Third    Male   0   0    7.2250   No
1308  Third    Male   0   0    7.8750   No

[1308 rows x 6 columns]

#Replace string values to unique integers

In [55]:
df_clean_factorize = df_clean_row
p_class, unused = pd.factorize(df_clean_row[0])
p_sex, unused = pd.factorize(df_clean_row[2])
p_survived, unused = pd.factorize(df_clean_row[11])
df_clean_factorize[0] = p_class
df_clean_factorize[2] = p_sex
df_clean_factorize[11] = p_survived
df_clean_factorize.head()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys

   0   2   4   5         7   11
0   0   0   0   0  211.3375   0
1   0   1   1   2  151.5500   0
2   0   0   1   2  151.5500   1
3   0   1   1   2  151.5500   1
4   0   0   1   2  151.5500   1